# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GitHub command-line tool
brew "gh"
brew "mole"
# Libraries for security-enabled client and server applications
brew "nss"
brew "fzf"
brew "zoxide"
# Cross-shell prompt for astronauts
brew "starship"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Persistent memory for AI coding agents. Agent-agnostic, single binary, zero dependencies.
brew "gentleman-programming/tap/engram"
# Gentle-AI — Ecosystem, Frameworks, Workflows for AI coding agents.
brew "gentleman-programming/tap/gentle-ai", trusted: true
# Gentleman Guardian Angel - Provider-agnostic code review using AI (Claude, Gemini, Codex, OpenCode, Ollama)
brew "gentleman-programming/tap/gga"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Virtual monitor for screen sharing
cask "deskpad"
# Collaborative team software
cask "figma"
# Font for programming and terminal usage
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-iosevka-nerd-font"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
# System and utility switches
cask "only-switch"
# AI usage tracker for Cursor, Claude Code, Codex, Copilot and more
cask "openusage"
# Screenshot measurement and annotation tool
cask "shottr"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Rust-based terminal
cask "warp"
cask "visual-studio-code"
cask "orbstack"