# =============================================
# Mayco's Mac Setup
# =============================================
# Usage:
#   brew bundle                    # Install everything
#   brew bundle --dry-run          # Preview what would be installed
#   brew bundle dump               # Regenerate from current install

# ---- Taps ----
tap "gentleman-programming/tap"
tap "nrvim/tap"

# =============================================
# FORMULAS (CLI tools)
# =============================================

# Core
brew "gh"                        # GitHub CLI
brew "go"                        # Go language
brew "pnpm"                      # Fast package manager
brew "python@3.12"               # Python

# Dev tools
brew "mole"                      # Tunneling tool

# Security & networking
brew "nss"                       # Security libraries
brew "openssl@1.1"               # SSL/TLS toolkit

# Gentleman Programming tools
brew "gentleman-programming/tap/engram"
brew "gentleman-programming/tap/gentle-ai"
brew "gentleman-programming/tap/gga"

# Other
brew "nrvim/tap/garmin-givemydata"
# =============================================
# CASKS (GUI Applications)
# =============================================

# Browsers
cask "brave-browser"
cask "chromium"
cask "firefox"
cask "google-chrome"

# Security
cask "1password"

# Dev tools
cask "cursor"                    # AI code editor
cask "docker-desktop"            # Containerization
cask "github"                    # GitHub Desktop
cask "insomnia"                  # API testing
cask "iterm2"                    # Terminal emulator

cask "postman"                   # API testing
cask "visual-studio-code"        # Code editor
cask "warp"                      # Modern terminal

# Design & media
cask "figma"                     # Design tool
cask "tidal"                     # Music streaming
cask "deepl"                     # Translation tool

# System utilities
cask "raycast"                   # Productivity launcher
cask "betterdisplay"             # Display management
cask "deskpad"                   # Virtual monitor
cask "hiddenbar"                 # Hide menu bar items
cask "itsycal"                   # Menu bar calendar
cask "karabiner-elements"        # Keyboard customizer
cask "logitune"                  # Logitech webcam settings
cask "only-switch"               # System switches
cask "pearcleaner"               # App uninstaller
cask "shottr"                    # Screenshot tool
cask "superwhisper"              # Dictation with AI
cask "openusage"                 # Usage tracking
cask "anydesk"                   # Remote desktop
cask "slack"                     # Team messaging
cask "telegram"                  # Messaging
cask "zoom"                      # Video conferencing

# Gentleman Programming
cask "mole-app"

# Fonts
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono"

# =============================================
# VSCODE EXTENSIONS
# =============================================

# Themes & icons
vscode "antfu.icons-carbon"
vscode "github.github-vscode-theme"
vscode "liviuschera.noctis"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "teabyii.ayu"
vscode "vscode-icons-team.vscode-icons"
vscode "miguelsolorio.fluent-icons"

# Editor enhancements
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "kamikillerto.vscode-colorize"
vscode "johnpapa.vscode-peacock"
vscode "patbenatar.advanced-new-file"
vscode "sleistner.vscode-fileutils"
vscode "wayou.vscode-todo-highlight"
vscode "usernamehw.errorlens"
vscode "simonsiefke.svg-preview"

# Languages & frameworks
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "kumar-harsh.graphql-for-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "mattpocock.ts-error-translator"

# Git & GitHub
vscode "eamodio.gitlens"
vscode "github.vscode-github-actions"

# Productivity
vscode "augment.vscode-augment"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "chakrounanas.turbo-console-log"
vscode "kisstkondoros.vscode-codemetrics"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "tabnine.tabnine-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"

# =============================================
# NPM GLOBAL PACKAGES
# =============================================

npm "@augmentcode/auggie"
npm "@playwright/cli"
npm "corepack"
