# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Deep clean and optimize your Mac
brew "mole"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Command-line interface for Render
brew "render"
# Cross-shell prompt for astronauts
brew "starship"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Persistent memory for AI coding agents. Agent-agnostic, single binary, zero dependencies.
brew "gentleman-programming/tap/engram"
# Gentle-AI — Ecosystem, Frameworks, Workflows for AI coding agents.
brew "gentleman-programming/tap/gentle-ai", trusted: true
# Gentleman Guardian Angel - Provider-agnostic code review using AI (Claude, Gemini, Codex, OpenCode, Ollama)
brew "gentleman-programming/tap/gga"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# GUI app for Homebrew
cask "cakebrew"
# Free and open-source web browser
cask "chromium"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Virtual monitor for screen sharing
cask "deskpad"
# Collaborative team software
cask "figma"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-sf-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
# Keyboard customiser
cask "karabiner-elements"
# Deep clean, analyze, and optimize app
cask "mole-app"
# System and utility switches
cask "only-switch"
# AI coding agent desktop client
cask "opencode-desktop"
# AI usage tracker for Cursor, Claude Code, Codex, Copilot and more
cask "openusage"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
# Screenshot measurement and annotation tool
cask "shottr"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp@beta"
